# GetPluginString

## Description
Returns the string specified by stringIndex. The strings are created using the &quot;Strings&quot; button in the plug-in editor.

```pascal
FUNCTION GetPluginString(stringIndex : INTEGER): STRING;
```

```python
def vs.GetPluginString(stringIndex):
    return STRING
```

## Parameters
|Name|Type|Description|
|---|---|---|
|stringIndex|INTEGER|The index of the string as represented in the plug-in editor.|

## Version
Availability: from VectorWorks10.0

## Category
* Objects - Custom